import UIKit

//1) Напишите переменные и константы всех базовых типов данных: int, UInt, float, double, string.
//У чисел вывести их минимальные и максимальные значения.

// тип переменных и констант можно задавать явно или неявно
var num1: Int = 5
var num2 = 8


var num3: UInt = 83

// Float 32 бит, 6 знаков после запятой, используют для экономии памяти.
let dick: Float = 4.8

// Double 64 бит, 15 знаков после запятой, используют по умолчанию для более точных вычислений и рекомендует Apple.
var num4: Double = 5.0

print(num3)
